app/views/home/show.html.haml

      コメント
      %span.badge{style: 'vertical-align: 5px'}= current_user.comments.size
---
SELECT "comments".* FROM "comments"  WHERE "comments"."user_id" = $1  [["user_id", 1]]
SELECT COUNT(*) FROM "comments"  WHERE "comments"."user_id" = $1  [["user_id", 1]]