app/controllers/home/articles_controller.rb

  def index
    if current_user.admin?
    @articles = Article.all.order(:created_at).page(params[:page]).per(5)
    elsif
    @articles = current_user.articles.all.order(:created_at).page(params[:page]).per(5)
---
SELECT  "articles".* FROM "articles"   ORDER BY "articles"."created_at" ASC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "articles"
SELECT  "articles".* FROM "articles"  WHERE "articles"."user_id" = $1  ORDER BY "articles"."created_at" ASC LIMIT 5 OFFSET 0  [["user_id", 2]]
SELECT COUNT(*) FROM "articles"  WHERE "articles"."user_id" = $1  [["user_id", 2]]

  def create
    @article = current_user.articles.build(article_params)
    @article.body = RedcarpetCompiler.compile(@article.body_source)

    if @article.valid?
      @article.save!
---
INSERT INTO "articles" ("aasm_state", "body", "body_source", "created_at", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update

    @article.assign_attributes(article_params)

    if @article.valid?
      @article.body = RedcarpetCompiler.compile(@article.body_source)
      @article.save!
---
UPDATE "articles" SET "title" = $1, "updated_at" = $2 WHERE "articles"."id" = 2  [["title", "oooood"], ["updated_at", "2015-03-19 05:52:13.746601"]]

    def set_article
      if current_user.admin?
        @article = Article.find(params[:id])
      elsif
        @article = current_user.articles.find(params[:id])
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = $1 LIMIT 1  [["id", 3]]
SELECT  "articles".* FROM "articles"  WHERE "articles"."user_id" = $1 AND "articles"."id" = $2 LIMIT 1  [["user_id", 2], ["id", 3]]