app/controllers/u_controller.rb

    def set_user
      @user = User.includes(:articles).where(screen_name: params[:id]).first
---
SELECT  "users".* FROM "users"  WHERE "users"."screen_name" = 'ozasuke'  ORDER BY "users"."id" ASC LIMIT 1
SELECT "articles".* FROM "articles"  WHERE "articles"."user_id" IN (1)